app/controllers/mensagems_controller.rb

SELECT "mensagems".* FROM "mensagems"
---
  def index
    new
    @mensagems = Mensagem.all

INSERT INTO "mensagems" ("conteudo", "autor", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["conteudo", "sadsadsa"], ["autor", "Luan"], ["created_at", "2015-08-06 14:44:02.552889"], ["updated_at", "2015-08-06 14:44:02.552889"]]
---
  def create
    @mensagem = Mensagem.new(mensagem_params)

    respond_to do |format|
      if @mensagem.save

DELETE FROM "mensagems" WHERE "mensagems"."id" = ?  [["id", 1]]
---
  def destroy
    @mensagem.destroy

SELECT  "mensagems".* FROM "mensagems" WHERE "mensagems"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_mensagem
      @mensagem = Mensagem.find(params[:id])